In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/cleaned_churn_data.csv')
df.head()

,customer_id,gender,senior_citizen,tenure,contract_type,monthly_charges,total_charges,internet_service,streaming,security,tech_support,churn
0,7590-VHVEG,Female,0,1,Month-to-month,29.85,29.85,DSL,No,No,No,0
1,5575-GNVDE,Male,0,34,One year,56.95,1889.50,DSL,No,Yes,No,0
2,3668-QPYBK,Male,0,2,Month-to-month,53.85,108.15,DSL,No,Yes,No,1
3,7795-CFOCW,Male,0,45,One year,42.30,1840.75,DSL,No,Yes,Yes,0
4,9237-HQITU,Female,0,2,Month-to-month,70.70,151.65,Fiber optic,No,No,No,1

In [3]:
df['tenure_group'] = pd.cut(
    df['tenure'],
    bins=[0, 6, 12, 24, 60],
    labels=['0-6', '6-12', '12-24', '24+']
)

In [4]:
df[['tenure', 'tenure_group']].head(10)

   tenure tenure_group
0       1          0-6
1      34          24+
2       2          0-6
3      45          24+
4       2          0-6
5       8         6-12
6      22        12-24
7      10         6-12
8      28          24+
9      62          NaN

In [5]:
median_charge = df['monthly_charges'].median()
median_charge

70.35

In [6]:
df['high_monthly_charge'] = (df['monthly_charges'] > median_charge).astype(int)

In [7]:
df[['monthly_charges', 'high_monthly_charge']].head()

   monthly_charges  high_monthly_charge
0            29.85                    0
1            56.95                    0
2            53.85                    0
3            42.30                    0
4            70.70                    1

In [8]:
service_cols = ['internet_service', 'streaming', 'security', 'tech_support']

In [9]:
df[service_cols] = df[service_cols].apply(lambda x: x.map({'Yes': 1, 'No': 0}))
df['service_count'] = df[service_cols].sum(axis=1)

In [10]:
df[['internet_service', 'streaming', 'security', 'tech_support', 'service_count']].head()

   internet_service  streaming  security  tech_support  service_count
0               NaN        0.0       0.0           0.0            0.0
1               NaN        0.0       1.0           0.0            1.0
2               NaN        0.0       1.0           0.0            1.0
3               NaN        0.0       1.0           1.0            2.0
4               NaN        0.0       0.0           0.0            0.0

In [11]:
df['is_monthly_contract'] = (df['contract_type'] == 'Month-to-month').astype(int)

In [12]:
df[['contract_type', 'is_monthly_contract']].head()

    contract_type  is_monthly_contract
0  Month-to-month                    1
1        One year                    0
2  Month-to-month                    1
3        One year                    0
4  Month-to-month                    1

In [13]:
df.head()

,customer_id,gender,senior_citizen,tenure,contract_type,monthly_charges,total_charges,internet_service,streaming,security,tech_support,churn,tenure_group,high_monthly_charge,service_count,is_monthly_contract
0,7590-VHVEG,Female,0,1,Month-to-month,29.85,29.85,NaN,0.0,0.0,0.0,0,0-6,0,0.0,1
1,5575-GNVDE,Male,0,34,One year,56.95,1889.50,NaN,0.0,1.0,0.0,0,24+,0,1.0,0
2,3668-QPYBK,Male,0,2,Month-to-month,53.85,108.15,NaN,0.0,1.0,0.0,1,0-6,0,1.0,1
3,7795-CFOCW,Male,0,45,One year,42.30,1840.75,NaN,0.0,1.0,1.0,0,24+,0,2.0,0
4,9237-HQITU,Female,0,2,Month-to-month,70.70,151.65,NaN,0.0,0.0,0.0,1,0-6,1,0.0,1

In [14]:
df.to_csv('../data/feature_ready_churn_data.csv', index=False)